[M_Aster_PlotMission01 MissionDefinition]
MissionDescription="Lacking anything else to do, Tina, Lilith, Mordecai and Brick have decided to play a round of Pandora's most famous role-playing game, ''Bunkers & Badasses''. Basically, this means that you're currently inside Tiny Tina's imagination. God help you.<br><br>Your adventure begins outside the town of [place]Flamerock Refuge[-place]. Tina, your Bunker Master, has asked you to head to the town."
TurnInDescription="And so the Vault Hunters proved their badassitude to the gatekeeper Torgue, ignorant of the horrors that awaited them in the darkened forest..."

[M_Aster_PlotMission01:DefeatBoneyManGuySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lacking anything else to do, Tina, Lilith, Mordecai and Brick have decided to play a round of Pandora's most famous role-playing game, ''Bunkers & Badasses.'' Basically, this means that you're currently inside Tiny Tina's imagination. God help you.<br><br>Your adventure begins outside the town of [place]Flamerock Refuge[-place]. Tina, your Bunker Master, has asked you to head to the town.<br><br>After losing a poorly-designed boss fight against a dragon, Tina summoned a skeleton enemy named Mister Boney Pants Guy. Waste him."

[M_Aster_PlotMission01:Defeatdragonset MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lacking anything else to do, Tina, Lilith, Mordecai and Brick have decided to play a round of Pandora's most famous role-playing game, ''Bunkers & Badasses.'' Basically, this means that you're currently inside Tiny Tina's imagination. God help you.<br><br>Your adventure begins outside the town of [place]Flamerock Refuge[-place]. Tina, your Bunker Master, has asked you to head to the town.<br><br>Suddenly, a dragon attacks! Defend yourself!"

[M_Aster_PlotMission01:EnterForestSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Talk to the gatekeeper."
MissionDescriptionOverride="Lacking anything else to do, Tina, Lilith, Mordecai and Brick have decided to play a round of Pandora's most famous role-playing game, ''Bunkers & Badasses.'' Basically, this means that you're currently inside Tiny Tina's imagination. God help you.<br><br>The townsfolk of [place]Flamerock Refuge[-place] have given you a lead on where you might find some adventure -- the queen has gone missing, and only her bodyguard, Eleanor, knows where she went.<br><br>Eleanor informed you that the queen disappeared in the nearby forest. She's asked you to find this mysterious queen, so that she may reverse the Handsome Sorcerer's spell and bring light back to the world."

[M_Aster_PlotMission01:FineEllieInvisibleSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lacking anything else to do, Tina, Lilith, Mordecai and Brick have decided to play a round of Pandora's most famous role-playing game, ''Bunkers & Badasses.'' Basically, this means that you're currently inside Tiny Tina's imagination. God help you.<br><br>The townsfolk of [place]Flamerock Refuge[-place] have given you a lead on where you might find some adventure -- the queen has gone missing, and only her bodyguard, Eleanor, knows where she went."

[M_Aster_PlotMission01:GetTorguePermissionSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Do stuff for Mister Torgue so he'll let you into the forest."
MissionDescriptionOverride="Lacking anything else to do, Tina, Lilith, Mordecai and Brick have decided to play a round of Pandora's most famous role-playing game, ''Bunkers & Badasses.'' Basically, this means that you're currently inside Tiny Tina's imagination. God help you.<br><br>The townsfolk of [place]Flamerock Refuge[-place] have given you a lead on where you might find some adventure -- the queen has gone missing, and only her bodyguard, Eleanor, knows where she went.<br><br>Eleanor informed you that the queen disappeared in the nearby forest. She's asked you to find this mysterious queen, so that she may reverse the Handsome Sorcerer's spell and bring light back to the world.<br><br>Just as you were about to enter the forest, however, Mister Torgue interrupted Tina and demanded to be let into the game. Taking over the role of the Gatekeeper, Torgue has asked you to do some random, badass stuff to prove that you're strong enough to survive the horrors of the forest."

[M_Aster_PlotMission01:GetTorguePermissionSet2 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lacking anything else to do, Tina, Lilith, Mordecai and Brick have decided to play a round of Pandora's most famous role-playing game, ''Bunkers & Badasses.'' Basically, this means that you're currently inside Tiny Tina's imagination. God help you.<br><br>The townsfolk of [place]Flamerock Refuge[-place] have given you a lead on where you might find some adventure -- the queen has gone missing, and only her bodyguard, Eleanor, knows where she went.<br><br>Eleanor informed you that the queen disappeared in the nearby forest. She's asked you to find this mysterious queen, so that she may reverse the Handsome Sorcerer's spell and bring light back to the world.<br><br>Just as you were about to enter the forest, however, Mister Torgue interrupted Tina and demanded to be let into the game. Taking over the role of the Gatekeeper, Torgue asked you to do some random, badass stuff to prove that you're strong enough to survive the horrors of the forest.<br><br>Having completed these tasks, however, you are now free to talk to Torgue and gain entrance to the forest."

[M_Aster_PlotMission01:HeadToFlameStoneRefuge2 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lacking anything else to do, Tina, Lilith, Mordecai and Brick have decided to play a round of Pandora's most famous role-playing game, ''Bunkers & Badasses.'' Basically, this means that you're currently inside Tiny Tina's imagination. God help you.<br><br>Your adventure begins outside the town of [place]Flamerock Refuge[-place]. Tina, your Bunker Master, has asked you to head to the town."

[M_Aster_PlotMission01:KillNewBoss MissionObjectiveDefinition]
ProgressMessage="Defeat new boss"

[M_Aster_PlotMission01:PunchBarGuyExplodes MissionObjectiveDefinition]
ProgressMessage="Punch bar patron so hard he explodes"

[M_Aster_PlotMission01:TalkToGateKeeper MissionObjectiveDefinition]
ProgressMessage="Talk to gatekeeper"

[M_Aster_PlotMission01:Talktotownsfolk MissionObjectiveDefinition]
ProgressMessage="Talk to townsfolk"

[M_Aster_PlotMission01:TalktotownsfolkSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Talk to the townsfolk."
MissionDescriptionOverride="Lacking anything else to do, Tina, Lilith, Mordecai and Brick have decided to play a round of Pandora's most famous role-playing game, ''Bunkers & Badasses.'' Basically, this means that you're currently inside Tiny Tina's imagination. God help you.<br><br>Having reached the town of [place]Flamerock Refuge[-place], you should probably take a look around and talk to some townsfolk. Like you do. "
